Tekla Open API Reference for Tekla Structures 2025
RebarStrand.Patterns Property
 An array list of polygons that represents the patterns of the rebar strand. Give the strand positions in the same order as for the first pattern. The maximum number of patterns is 20.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Patterns { get; set; }
Public Property Patterns As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
RebarStrand Class
Tekla.Structures.Model Namespace